read_verilog ../rtl/spram_model.v
read_verilog ../rtl/picorv32.v
read_verilog ../rtl/spimemio.v
read_verilog ../rtl/simpleuart.v
read_verilog ../rtl/retrosoc.v
read_verilog ../rtl/retrosoc_asic.v

hierarchy -top retrosoc_asic
proc; flatten

synth;

dfflibmap -liberty ../syn/IHP-Open-PDK/ihp-sg13g2/libs.ref/sg13g2_stdcell/lib/sg13g2_stdcell_typ_1p20V_25C.lib
abc -liberty ../syn/IHP-Open-PDK/ihp-sg13g2/libs.ref/sg13g2_stdcell/lib/sg13g2_stdcell_typ_1p20V_25C.lib

stat

write_verilog retrosoc_syn.v
