read_verilog ../rtl/spram_model.v
read_verilog ../rtl/picorv32.v
read_verilog ../rtl/spimemio.v
read_verilog ../rtl/simpleuart.v
read_verilog ../rtl/picosoc.v
read_verilog ../rtl/retrosoc.v

hierarchy -top retrosoc
proc; flatten

synth;

dfflibmap -liberty osu018_stdcells.lib
abc -liberty osu018_stdcells.lib;

stat
